#include <iostream>
using namespace std;

/*
Алгоритмічні завдання "на подумати" :)
Оцініть часову складність кожного алгоритму. Поясніть свої оцінки.
В ідеалі, кожне з цих завдань має бути реалізовано ще і як код мовою С++.

1) Знайти суму всіх елементів у масиві.
2) Знайти максимальний елемент у масиві.
3) Перевірити, чи є задане число простим.
4) Підрахувати кількість унікальних елементів у масиві.
5) Підрахувати середнє арифметичне всіх елементів у масиві.
6) Пошук найбільшого спільного дільника (НСД) двох чисел.
7) Пошук найменшого загального кратного (НЗК) двох чисел.
8) Перевірка, чи є заданий рядок паліндромом (читається однаково з початку та з кінця).
9) Знайти найбільший загальний підрядок у двох рядках.
10) Перевірити, чи є заданий рядок анаграмою іншого рядка.
11) Підрахувати кількість способів розміняти суму грошей заданими номіналами монет.
12) Пошук найбільшого числа, яке можна уявити як суму двох чисел із заданого масиву.
*/

int main()
{

}
