#include <iostream>
using namespace std;

/*
Алгоритмические задачи "на подумать" :)
Оцените временную сложность каждого алгоритма. Объясните свои оценки.
В идеале, каждое из этих заданий должно быть реализовано ещё
и в виде кода на языке С++.

1) Найти сумму всех элементов в массиве.

2) Найти максимальный элемент в массиве.

3) Проверить, является ли заданное число простым.

4) Подсчитать количество уникальных элементов в массиве.

5) Подсчитать среднее арифметическое всех элементов в массиве.

6) Поиск наибольшего общего делителя (НОД) двух чисел.

7) Поиск наименьшего общего кратного (НОК) двух чисел.

8) Проверка, является ли заданная строка палиндромом (читается
одинаково с начала и с конца).

9) Найти наибольшую общую подстроку в двух строках.

10) Проверить, является ли заданная строка анаграммой другой строки.

11) Подсчитать количество способов разменять сумму денег заданными
номиналами монет.

12) Поиск наибольшего числа, которое можно представить как
сумму двух чисел из заданного массива.
*/

int main()
{
	
}